openocd-org/openocd/contrib/loaders/flash/max32xxx/tpu_regs.h
/* SPDX-License-Identifier: GPL-2.0-or-later */

/***************************************************************************
 *   Copyright (C) 2016 by Maxim Integrated                                *
 *   Copyright (C) 2025 Analog Devices, Inc.                               *
 ***************************************************************************/

#ifndef _TPU_REGS_H_
#define _TPU_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined(__ICCARM__)
#pragma system_include
#endif

/*/ @cond */
/*
	If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I volatile const
#endif
#ifndef __O
#define __O volatile
#endif
#ifndef __R
#define __R volatile const
#endif
/*/ @endcond */

/* **** Definitions **** */

/**
 * @ingroup     tpu
 * @defgroup    tpu_registers Registers
 * @brief       Registers, Bit Masks and Bit Positions for the TPU Peripheral Module.
 * @description The Trust Protection Unit used to assist the computationally intensive operations of several common
 * cryptographic algorithms.
 */

/**
 * @ingroup tpu_registers
 * Structure type to access the TPU Registers.
 */
struct mxc_tpu_regs {
	__IO uint32_t ctrl;			   /**< <tt>\b 0x00:<\tt> TPU CTRL Register */
	__IO uint32_t cipher_ctrl;	   /**< <tt>\b 0x04:<\tt> TPU CIPHER_CTRL Register */
	__IO uint32_t hash_ctrl;	   /**< <tt>\b 0x08:<\tt> TPU HASH_CTRL Register */
	__IO uint32_t crc_ctrl;		   /**< <tt>\b 0x0C:<\tt> TPU CRC_CTRL Register */
	__IO uint32_t dma_src;		   /**< <tt>\b 0x10:<\tt> TPU DMA_SRC Register */
	__IO uint32_t dma_dest;		   /**< <tt>\b 0x14:<\tt> TPU DMA_DEST Register */
	__IO uint32_t dma_cnt;		   /**< <tt>\b 0x18:<\tt> TPU DMA_CNT Register */
	__IO uint32_t maa_ctrl;		   /**< <tt>\b 0x1C:<\tt> TPU MAA_CTRL Register */
	__O uint32_t din[4];		   /**< <tt>\b 0x20:<\tt> TPU DIN Register */
	__I uint32_t dout[4];		   /**< <tt>\b 0x30:<\tt> TPU DOUT Register */
	__IO uint32_t crc_poly;		   /**< <tt>\b 0x40:<\tt> TPU CRC_POLY Register */
	__IO uint32_t crc_val;		   /**< <tt>\b 0x44:<\tt> TPU CRC_VAL Register */
	__I uint32_t crc_prng;		   /**< <tt>\b 0x48:<\tt> TPU CRC_PRNG Register */
	__IO uint32_t ham_ecc;		   /**< <tt>\b 0x4C:<\tt> TPU HAM_ECC Register */
	__IO uint32_t cipher_init[4];  /**< <tt>\b 0x50:<\tt> TPU CIPHER_INIT Register */
	__O uint32_t cipher_key[8];	   /**< <tt>\b 0x60:<\tt> TPU CIPHER_KEY Register */
	__IO uint32_t hash_digest[16]; /**< <tt>\b 0x80:<\tt> TPU HASH_DIGEST Register */
	__IO uint32_t hash_msg_sz[4];  /**< <tt>\b 0xC0:<\tt> TPU HASH_MSG_SZ Register */
	__IO uint32_t maa_maws;		   /**< <tt>\b 0xD0:<\tt> TPU MAA_MAWS Register */
};

/* Register offsets for module TPU */
/**
 * @ingroup    tpu_registers
 * @defgroup   TPU_Register_Offsets Register Offsets
 * @brief      TPU Peripheral Register Offsets from the TPU Base Peripheral Address.
 * @{
 */
#define MXC_R_TPU_CTRL ((uint32_t)0x00000000UL)		   /**< Offset from TPU Base Address: <tt> 0x0x000 */
#define MXC_R_TPU_CIPHER_CTRL ((uint32_t)0x00000004UL) /**< Offset from TPU Base Address: <tt> 0x0x004 */
#define MXC_R_TPU_HASH_CTRL ((uint32_t)0x00000008UL)   /**< Offset from TPU Base Address: <tt> 0x0x008 */
#define MXC_R_TPU_CRC_CTRL ((uint32_t)0x0000000CUL)	   /**< Offset from TPU Base Address: <tt> 0x0x00C */
#define MXC_R_TPU_DMA_SRC ((uint32_t)0x00000010UL)	   /**< Offset from TPU Base Address: <tt> 0x0x010 */
#define MXC_R_TPU_DMA_DEST ((uint32_t)0x00000014UL)	   /**< Offset from TPU Base Address: <tt> 0x0x014 */
#define MXC_R_TPU_DMA_CNT ((uint32_t)0x00000018UL)	   /**< Offset from TPU Base Address: <tt> 0x0x018 */
#define MXC_R_TPU_MAA_CTRL ((uint32_t)0x0000001CUL)	   /**< Offset from TPU Base Address: <tt> 0x0x01C */
#define MXC_R_TPU_DIN ((uint32_t)0x00000020UL)		   /**< Offset from TPU Base Address: <tt> 0x0x020 */
#define MXC_R_TPU_DOUT ((uint32_t)0x00000030UL)		   /**< Offset from TPU Base Address: <tt> 0x0x030 */
#define MXC_R_TPU_CRC_POLY ((uint32_t)0x00000040UL)	   /**< Offset from TPU Base Address: <tt> 0x0x040 */
#define MXC_R_TPU_CRC_VAL ((uint32_t)0x00000044UL)	   /**< Offset from TPU Base Address: <tt> 0x0x044 */
#define MXC_R_TPU_CRC_PRNG ((uint32_t)0x00000048UL)	   /**< Offset from TPU Base Address: <tt> 0x0x048 */
#define MXC_R_TPU_HAM_ECC ((uint32_t)0x0000004CUL)	   /**< Offset from TPU Base Address: <tt> 0x0x04C */
#define MXC_R_TPU_CIPHER_INIT ((uint32_t)0x00000050UL) /**< Offset from TPU Base Address: <tt> 0x0x050 */
#define MXC_R_TPU_CIPHER_KEY ((uint32_t)0x00000060UL)  /**< Offset from TPU Base Address: <tt> 0x0x060 */
#define MXC_R_TPU_HASH_DIGEST ((uint32_t)0x00000080UL) /**< Offset from TPU Base Address: <tt> 0x0x080 */
#define MXC_R_TPU_HASH_MSG_SZ ((uint32_t)0x000000C0UL) /**< Offset from TPU Base Address: <tt> 0x0x0C0 */
#define MXC_R_TPU_MAA_MAWS ((uint32_t)0x000000D0UL)	   /**< Offset from TPU Base Address: <tt> 0x0x0D0 */
													   /**@} end of group tpu_registers */

/**
 * @ingroup  tpu_registers
 * @defgroup CTRL_Register
 * @brief    Crypto Control Register.
 * @{
 */
#define MXC_F_TPU_CTRL_RST_POS 0										 /**< CTRL_RST Position */
#define MXC_F_TPU_CTRL_RST ((uint32_t)(0x1UL << MXC_F_TPU_CTRL_RST_POS)) /**< CTRL_RST Mask */

#define MXC_F_TPU_CTRL_INTR_POS 1										   /**< CTRL_INTR Position */
#define MXC_F_TPU_CTRL_INTR ((uint32_t)(0x1UL << MXC_F_TPU_CTRL_INTR_POS)) /**< CTRL_INTR Mask */

#define MXC_F_TPU_CTRL_SRC_POS 2										 /**< CTRL_SRC Position */
#define MXC_F_TPU_CTRL_SRC ((uint32_t)(0x1UL << MXC_F_TPU_CTRL_SRC_POS)) /**< CTRL_SRC Mask */

#define MXC_F_TPU_CTRL_BSO_POS 4										 /**< CTRL_BSO Position */
#define MXC_F_TPU_CTRL_BSO ((uint32_t)(0x1UL << MXC_F_TPU_CTRL_BSO_POS)) /**< CTRL_BSO Mask */

#define MXC_F_TPU_CTRL_BSI_POS 5										 /**< CTRL_BSI Position */
#define MXC_F_TPU_CTRL_BSI ((uint32_t)(0x1UL << MXC_F_TPU_CTRL_BSI_POS)) /**< CTRL_BSI Mask */

#define MXC_F_TPU_CTRL_WAIT_EN_POS 6											 /**< CTRL_WAIT_EN Position */
#define MXC_F_TPU_CTRL_WAIT_EN ((uint32_t)(0x1UL << MXC_F_TPU_CTRL_WAIT_EN_POS)) /**< CTRL_WAIT_EN Mask */

#define MXC_F_TPU_CTRL_WAIT_POL_POS 7											   /**< CTRL_WAIT_POL Position */
#define MXC_F_TPU_CTRL_WAIT_POL ((uint32_t)(0x1UL << MXC_F_TPU_CTRL_WAIT_POL_POS)) /**< CTRL_WAIT_POL Mask */

#define MXC_F_TPU_CTRL_WRSRC_POS 8											 /**< CTRL_WRSRC Position */
#define MXC_F_TPU_CTRL_WRSRC ((uint32_t)(0x3UL << MXC_F_TPU_CTRL_WRSRC_POS)) /**< CTRL_WRSRC Mask */
#define MXC_V_TPU_CTRL_WRSRC_NONE ((uint32_t)0x0UL)							 /**< CTRL_WRSRC_NONE Value */
#define MXC_S_TPU_CTRL_WRSRC_NONE                                                                                      \
	(MXC_V_TPU_CTRL_WRSRC_NONE << MXC_F_TPU_CTRL_WRSRC_POS) /**< CTRL_WRSRC_NONE Setting */
#define MXC_V_TPU_CTRL_WRSRC_CIPHEROUTPUT ((uint32_t)0x1UL) /**< CTRL_WRSRC_CIPHEROUTPUT Value */
#define MXC_S_TPU_CTRL_WRSRC_CIPHEROUTPUT                                                                              \
	(MXC_V_TPU_CTRL_WRSRC_CIPHEROUTPUT << MXC_F_TPU_CTRL_WRSRC_POS) /**< CTRL_WRSRC_CIPHEROUTPUT Setting */
#define MXC_V_TPU_CTRL_WRSRC_READFIFO ((uint32_t)0x2UL)				/**< CTRL_WRSRC_READFIFO Value */
#define MXC_S_TPU_CTRL_WRSRC_READFIFO                                                                                  \
	(MXC_V_TPU_CTRL_WRSRC_READFIFO << MXC_F_TPU_CTRL_WRSRC_POS) /**< CTRL_WRSRC_READFIFO Setting */
#define MXC_V_TPU_CTRL_WRSRC_RFU ((uint32_t)0x3UL)				/**< CTRL_WRSRC_RFU Value */
#define MXC_S_TPU_CTRL_WRSRC_RFU (MXC_V_TPU_CTRL_WRSRC_RFU << MXC_F_TPU_CTRL_WRSRC_POS) /**< CTRL_WRSRC_RFU Setting */

#define MXC_F_TPU_CTRL_RDSRC_POS 10											 /**< CTRL_RDSRC Position */
#define MXC_F_TPU_CTRL_RDSRC ((uint32_t)(0x3UL << MXC_F_TPU_CTRL_RDSRC_POS)) /**< CTRL_RDSRC Mask */
#define MXC_V_TPU_CTRL_RDSRC_DMADISABLED ((uint32_t)0x0UL)					 /**< CTRL_RDSRC_DMADISABLED Value */
#define MXC_S_TPU_CTRL_RDSRC_DMADISABLED                                                                               \
	(MXC_V_TPU_CTRL_RDSRC_DMADISABLED << MXC_F_TPU_CTRL_RDSRC_POS) /**< CTRL_RDSRC_DMADISABLED Setting */
#define MXC_V_TPU_CTRL_RDSRC_DMAORAPB ((uint32_t)0x1UL)			   /**< CTRL_RDSRC_DMAORAPB Value */
#define MXC_S_TPU_CTRL_RDSRC_DMAORAPB                                                                                  \
	(MXC_V_TPU_CTRL_RDSRC_DMAORAPB << MXC_F_TPU_CTRL_RDSRC_POS) /**< CTRL_RDSRC_DMAORAPB Setting */
#define MXC_V_TPU_CTRL_RDSRC_RNG ((uint32_t)0x2UL)				/**< CTRL_RDSRC_RNG Value */
#define MXC_S_TPU_CTRL_RDSRC_RNG (MXC_V_TPU_CTRL_RDSRC_RNG << MXC_F_TPU_CTRL_RDSRC_POS) /**< CTRL_RDSRC_RNG Setting */

#define MXC_F_TPU_CTRL_FLAG_MODE_POS 14												 /**< CTRL_FLAG_MODE Position */
#define MXC_F_TPU_CTRL_FLAG_MODE ((uint32_t)(0x1UL << MXC_F_TPU_CTRL_FLAG_MODE_POS)) /**< CTRL_FLAG_MODE Mask */

#define MXC_F_TPU_CTRL_DMADNEMSK_POS 15												 /**< CTRL_DMADNEMSK Position */
#define MXC_F_TPU_CTRL_DMADNEMSK ((uint32_t)(0x1UL << MXC_F_TPU_CTRL_DMADNEMSK_POS)) /**< CTRL_DMADNEMSK Mask */

#define MXC_F_TPU_CTRL_DMA_DONE_POS 24											   /**< CTRL_DMA_DONE Position */
#define MXC_F_TPU_CTRL_DMA_DONE ((uint32_t)(0x1UL << MXC_F_TPU_CTRL_DMA_DONE_POS)) /**< CTRL_DMA_DONE Mask */

#define MXC_F_TPU_CTRL_GLS_DONE_POS 25											   /**< CTRL_GLS_DONE Position */
#define MXC_F_TPU_CTRL_GLS_DONE ((uint32_t)(0x1UL << MXC_F_TPU_CTRL_GLS_DONE_POS)) /**< CTRL_GLS_DONE Mask */

#define MXC_F_TPU_CTRL_HSH_DONE_POS 26											   /**< CTRL_HSH_DONE Position */
#define MXC_F_TPU_CTRL_HSH_DONE ((uint32_t)(0x1UL << MXC_F_TPU_CTRL_HSH_DONE_POS)) /**< CTRL_HSH_DONE Mask */

